app/models/concerns/ticket_generator.rb

    def today_last_ticket(date)
      where("ticket_number LIKE ?", "#{date}-%").last
---
SELECT  "tickets".* FROM "tickets" WHERE (ticket_number LIKE '2021-07-04-%') ORDER BY "tickets"."id" DESC LIMIT ?  [["LIMIT", 1]]