app/controllers/tickets_controller.rb

SELECT "tickets".* FROM "tickets"
---
  def index
    @tickets = Ticket.all

INSERT INTO "tickets" ("ticket_title", "ticket_number", "due_date", "ticket_notes", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @ticket = Ticket.new(ticket_params)

    respond_to do |format|
      if @ticket.save

UPDATE "tickets" SET "ticket_number" = ?, "updated_at" = ? WHERE "tickets"."id" = ?  [["ticket_number", "2021-07-04-003"], ["updated_at", "2021-07-04 09:32:44.943558"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @ticket.update(ticket_params)

DELETE FROM "tickets" WHERE "tickets"."id" = ?  [["id", 3]]
---
  def destroy
    @ticket.destroy

SELECT  "tickets".* FROM "tickets" WHERE "tickets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_ticket
      @ticket = Ticket.find(params[:id])